# Trying Prophet for time series forecasting
Material obtained from [here](https://www.youtube.com/watch?v=KvLG1uTC-KU)   
Nov 30th 2021

In [7]:
import os
import sys
import pandas as pd
from prophet import Prophet
print(sys.executable)

/home/razielar/miniconda3/envs/ml/bin/python

## Read data

In [16]:
df= pd.read_csv("dataset/dataset.csv")
print(df.shape)
df.head()

(1080, 4)

   Time Date  Product          Store     Value
0    1012018  2667437  QLD_CW_ST0203  2926.000
1    2012018  2667437  QLD_CW_ST0203  2687.531
2    3012018  2667437  QLD_CW_ST0203  2793.000
3    4012018  2667437  QLD_CW_ST0203  2394.000
4    5012018  2667437  QLD_CW_ST0203  2660.000

In [18]:
print(df["Product"].unique())
print(df["Store"].uniquee())

[2667437]
['QLD_CW_ST0203']

In [19]:
df.dtypes

Time Date      int64
Product        int64
Store         object
Value        float64
dtype: object

In [33]:
df["Year"]= df["Time Date"].apply(lambda x: str(x)[-4:])
df["Month"]= df["Time Date"].apply(lambda x: str(x)[-6:-4])
df["Day"]= df["Time Date"].apply(lambda x: str(x)[:-6])
df["ds"]= pd.DatetimeIndex(df["Year"] + "-" + df["Month"] + "-" + df["Day"])

In [34]:
df.head()

   Time Date  Product          Store     Value  Year Month Day         ds
0    1012018  2667437  QLD_CW_ST0203  2926.000  2018    01   1 2018-01-01
1    2012018  2667437  QLD_CW_ST0203  2687.531  2018    01   2 2018-01-02
2    3012018  2667437  QLD_CW_ST0203  2793.000  2018    01   3 2018-01-03
3    4012018  2667437  QLD_CW_ST0203  2394.000  2018    01   4 2018-01-04
4    5012018  2667437  QLD_CW_ST0203  2660.000  2018    01   5 2018-01-05

In [35]:
df.dtypes

Time Date             int64
Product               int64
Store                object
Value               float64
Year                 object
Month                object
Day                  object
ds           datetime64[ns]
dtype: object